fakereddit/app/models/user.rb

  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "edward"], ["LIMIT", 1]]

  def reset_session_token!
      self.session_token = self.class.generate_session_token
      self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "35UfKJy0GevreOrXK-Zx1Q"], ["updated_at", "2019-09-10 15:56:14.834380"], ["id", 2]]