fakereddit/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
SELECT "subs"."id" FROM "subs" INNER JOIN "postsubs" ON "subs"."id" = "postsubs"."sub_id" WHERE "postsubs"."post_id" = $1  [["post_id", 8]]
---

    <% Sub.all.each do |sub|  %>
      <label>
          <input type="checkbox" name="post[sub_ids][]" value='<%= sub.id %>' <%= "checked" if @post.sub_ids.include?(sub.id) %>>