fakereddit/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 26]]
---

<% @post.comments.each do |comment| %>