fakereddit/app/controllers/application_controller.rb

    def current_user
      @current_user ||= User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "35UfKJy0GevreOrXK-Zx1Q"], ["LIMIT", 1]]