fakereddit/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "author_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "hahahahaha"], ["post_id", 26], ["author_id", 2], ["created_at", "2019-09-10 21:20:09.156187"], ["updated_at", "2019-09-10 21:20:09.156187"], ["parent_comment_id", 1]]
---
def create
  @comment = Comment.new(comment_params)
  @comment.author_id = current_user.id
  @comment.post_id = params[:post_id]
  @comment.parent_comment_id = params[:parent_comment_id]
  if @comment.save

UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "much kewl, super!"], ["updated_at", "2019-09-10 21:31:52.395948"], ["id", 6]]
---
def update
  @comment = current_user.comments.find_by(id: params[:id])
  if @comment.update_attributes(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def show
  @comment = Comment.find(params[:id])