fakereddit/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    @post.author_id = current_user.id
    # @post.sub_ids = post_params[:sub_ids]
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "adf"], ["url", "sdklfgsd;lgkjsd;f"], ["content", "sdfhkldsfgh"], ["author_id", 2], ["created_at", "2019-09-10 19:45:13.754693"], ["updated_at", "2019-09-10 19:45:13.754693"]]

  def show
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def update
    @post = current_user.posts.find(params[:id])
    if @post.update_attributes(post_params)
---
UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "NOPE"], ["url", "nope"], ["content", "nope"], ["updated_at", "2019-09-10 20:23:15.147301"], ["id", 8]]