fakereddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Cats"], ["description", "This is a sub about cats "], ["moderator_id", 3], ["created_at", "2019-09-10 17:36:04.359398"], ["updated_at", "2019-09-10 17:36:04.359398"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @sub = current_user.moderated_subs.find_by(id: params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "add a cancel"], ["updated_at", "2019-09-10 18:10:08.716790"], ["id", 3]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.update_attributes(sub_params)

SELECT "subs".* FROM "subs"
---
  def index
    @subs = Sub.all

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sub = Sub.find(params[:id])